#+TITLE: Table Export Examples
#+AUTHOR: ox-ipynb examples
#+DESCRIPTION: Demonstrates various table formats in Jupyter notebooks

* Simple Tables

** Basic Table

Here's a simple table with data:

| Name    | Age | City          |
|---------+-----+---------------|
| Alice   |  30 | New York      |
| Bob     |  25 | San Francisco |
| Charlie |  35 | Boston        |
| Diana   |  28 | Seattle       |

** Table with Alignment

Tables with different column alignments. This doesn't affect the notebook output, but at least exports correctly.

| Left Aligned | Center | Right Aligned |
|--------------+--------+---------------|
| <l>          |  <c>   |           <r> |
| Text         |  123   |          45.2 |
| More text    |  456   |          78.9 |
| Even more    |  789   |          12.3 |

* Tables from Code

** Pandas DataFrame

#+BEGIN_SRC jupyter-python
import pandas as pd
import numpy as np

# Create a sample dataframe
data = {
    'Product': ['Apple', 'Banana', 'Orange', 'Grape'],
    'Price': [1.50, 0.75, 2.00, 3.50],
    'Quantity': [100, 150, 75, 50],
    'Revenue': [150.0, 112.5, 150.0, 175.0]
}

df = pd.DataFrame(data)
print(df)
#+END_SRC

#+RESULTS:
:   Product  Price  Quantity  Revenue
: 0   Apple   1.50       100    150.0
: 1  Banana   0.75       150    112.5
: 2  Orange   2.00        75    150.0
: 3   Grape   3.50        50    175.0

** NumPy Array as Table

#+BEGIN_SRC jupyter-python
# Create a multiplication table
n = 5
mult_table = np.outer(np.arange(1, n+1), np.arange(1, n+1))

# Create DataFrame for better display
mult_df = pd.DataFrame(
    mult_table,
    columns=[f'{i}' for i in range(1, n+1)],
    index=[f'{i}' for i in range(1, n+1)]
)

print("Multiplication Table:")
print(mult_df)
#+END_SRC

#+RESULTS:
: Multiplication Table:
:    1   2   3   4   5
: 1  1   2   3   4   5
: 2  2   4   6   8  10
: 3  3   6   9  12  15
: 4  4   8  12  16  20
: 5  5  10  15  20  25

* Complex Tables

** Table with Calculated Values

| Item       | Unit Price | Quantity | Total    |
|------------+------------+----------+----------|
| Laptops    |       1200 |       10 | $12,000  |
| Monitors   |        350 |       15 | $5,250   |
| Keyboards  |         80 |       25 | $2,000   |
| Mice       |         40 |       30 | $1,200   |
|------------+------------+----------+----------|
| *Total*    |            |          | *$20,450* |

** Statistical Summary Table

| Statistic | Values       |
|-----------+--------------|
| Mean      | 45.6         |
| Median    | 42.3         |
| Std Dev   | 12.8         |
| Min       | 12.1         |
| Max       | 89.7         |
| Count     | 150          |

* Notes

Tables in Jupyter notebooks are rendered as markdown tables. For more
complex table formatting, consider using pandas DataFrames or HTML tables
within code cells.
